Revit 2024 API
BuiltInFailures.DesignOptionFailures.CannotAddToOptionsWarn Property
 Elements can't be added to Option Set
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotAddToOptionsWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotAddToOptionsWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotAddToOptionsWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace